MarlinFirmware/Marlin/Marlin/src/HAL/HAL_LPC1768/framework_cmsis/Device/NXP/LPC17xx/drivers/source/lpc17xx_i2c.c
			}
			break;
		case I2C_I2STAT_M_TX_DAT_NACK:
			I2C_Stop(I2Cx);
			Ret = I2C_SEND_END;
			break;
		case I2C_I2STAT_M_RX_ARB_LOST:
		//case I2C_I2STAT_M_TX_ARB_LOST:
			I2Cx->I2CONSET = I2C_I2CONSET_STA|I2C_I2CONSET_AA;
			I2Cx->I2CONCLR = I2C_I2CONCLR_SIC;
			break;
		case I2C_I2STAT_M_RX_SLAR_ACK:
			I2Cx->I2CONSET = I2C_I2CONSET_AA;
			I2Cx->I2CONCLR = I2C_I2CONCLR_SIC;

			Ret = I2C_BYTE_RECV;
			break;
		case I2C_I2STAT_M_RX_DAT_ACK:
			if (TransferCfg->rx_count <TransferCfg->rx_length)
			{
				if (TransferCfg->rx_count < (TransferCfg->rx_length - 2))
				{
					I2C_GetByte(I2Cx, &tmp, TRUE);

					Ret = I2C_BYTE_RECV;
				}
				else  // the next byte is the last byte, send NACK instead.
				 {
					I2C_GetByte(I2Cx, &tmp, FALSE);
					Ret = I2C_BYTE_RECV;
				 }
				*rxdat++ = tmp;

				TransferCfg->rx_count++;
			}
			 else
			 {
				Ret = I2C_RECV_END;
			}
			
			break;
		case I2C_I2STAT_M_RX_DAT_NACK:
			I2C_GetByte(I2Cx, &tmp, FALSE);
			*rxdat++ = tmp;
			TransferCfg->rx_count++;
			I2C_Stop(I2Cx);
			Ret = I2C_RECV_END;
			break;
		case I2C_I2STAT_M_RX_SLAR_NACK:
		case I2C_I2STAT_M_TX_SLAW_NACK:
		case I2C_I2STAT_BUS_ERROR:
			// Send STOP condition
			I2C_Stop(I2Cx);
			Ret = I2C_ERR;
			break;
		/* No status information */
		case I2C_I2STAT_NO_INF:
		default:
			I2Cx->I2CONCLR = I2C_I2CONCLR_SIC;
			break;
	}
	
	return Ret;
}

/*********************************************************************//**
 * @brief 		Handle I2C Slave states.
 * @param[in]	I2Cx	I2C peripheral selected, should be:
 * 				- LPC_I2C
 * 				- LPC_I2C1
 * 				- LPC_I2C2
 * @param[in]	CodeStatus	I2C state
 * @param[in]	TransferCfg   Pointer to a I2C_S_SETUP_Type structure that
 * 								contains specified information about the
 * 								configuration for master transfer.
 * @return 		It can be
 *				- I2C_OK
 *				-I2C_BYTE_RECV
 *				-I2C_BYTE_SENT
 *				-I2C_SEND_END
 *				-I2C_RECV_END
 *				- I2C_ERR
 *				- I2C_NAK_RECV
 **********************************************************************/
int32_t I2C_SlaveHanleStates(LPC_I2C_TypeDef  *I2Cx, uint32_t CodeStatus, I2C_S_SETUP_Type *TransferCfg)
{

	int32_t Ret = I2C_OK;
	uint8_t *txdat;
	uint8_t *rxdat;

	//get buffer to send/receive
	txdat = (uint8_t *) &TransferCfg->tx_data[TransferCfg->tx_count];
	rxdat = (uint8_t *) &TransferCfg->rx_data[TransferCfg->rx_count];
	
	switch (CodeStatus)
	{
		/* Reading phase -------------------------------------------------------- */
		/* Own SLA+R has been received, ACK has been returned */
		case I2C_I2STAT_S_RX_SLAW_ACK:

		/* General call address has been received, ACK has been returned */
		case I2C_I2STAT_S_RX_GENCALL_ACK:
			I2Cx->I2CONSET = I2C_I2CONSET_AA;
			I2Cx->I2CONCLR = I2C_I2CONCLR_SIC;
			break;
		/* Arbitration has been lost in Slave Address + R/W bit as bus Master. General Call has
			been received and ACK has been returned.*/
		case I2C_I2STAT_S_RX_ARB_LOST_M_GENCALL:
			I2Cx->I2CONSET = I2C_I2CONSET_AA|I2C_I2CONSET_STA;
			I2Cx->I2CONCLR = I2C_I2CONCLR_SIC;
			break;
		/* Previously addressed with own SLA;
		 * DATA byte has been received;
		 * ACK has been returned */
		case I2C_I2STAT_S_RX_ARB_LOST_M_SLA:
		case I2C_I2STAT_S_RX_PRE_SLA_DAT_ACK:

			/*
			 * All data bytes that over-flow the specified receive
			 * data length, just ignore them.
			 */
			if ((TransferCfg->rx_count < TransferCfg->rx_length) && (TransferCfg->rx_data != NULL))
			{
				*rxdat++ = (uint8_t)I2Cx->I2DAT;

				TransferCfg->rx_count++;

				Ret = I2C_BYTE_RECV;
			}
			if(TransferCfg->rx_count == (TransferCfg->rx_length) ) {
				I2Cx->I2CONCLR = I2C_I2CONCLR_AAC|I2C_I2CONCLR_SIC;
				Ret = I2C_BYTE_RECV;
			}
			else {
				I2Cx->I2CONSET = I2C_I2CONSET_AA;
				I2Cx->I2CONCLR = I2C_I2CONCLR_SIC;
			}
			
			break;
		/* DATA has been received, Only the first data byte will be received with ACK. Additional
				data will be received with NOT ACK. */
		case I2C_I2STAT_S_RX_PRE_GENCALL_DAT_ACK:
			if ((TransferCfg->rx_count < TransferCfg->rx_length) && (TransferCfg->rx_data != NULL))
			{
				*rxdat++ = (uint8_t)I2Cx->I2DAT;

				TransferCfg->rx_count++;

				Ret = I2C_BYTE_RECV;
			}
			I2Cx->I2CONCLR = I2C_I2CONCLR_AAC|I2C_I2CONCLR_SIC;
			break;

		/* Writing phase -------------------------------------------------------- */
		/* Own SLA+R has been received, ACK has been returned */
		case I2C_I2STAT_S_TX_SLAR_ACK:

		/* Data has been transmitted, ACK has been received */
		case I2C_I2STAT_S_TX_DAT_ACK:
			/*
			 * All data bytes that over-flow the specified receive
			 * data length, just ignore them.
			 */
			if ((TransferCfg->tx_count < TransferCfg->tx_length) && (TransferCfg->tx_data != NULL))
			{
				I2Cx->I2DAT = *txdat++;

				TransferCfg->tx_count++;

				Ret = I2C_BYTE_SENT;
			}

			I2Cx->I2CONSET = I2C_I2CONSET_AA;
			I2Cx->I2CONCLR = I2C_I2CONCLR_SIC;
			break;
		/* Arbitration lost in Slave Address and R/W bit as bus Master. Own Slave Address + Read
				has been received, ACK has been returned. */
		case I2C_I2STAT_S_TX_ARB_LOST_M_SLA:
			if ((TransferCfg->tx_count < TransferCfg->tx_length) && (TransferCfg->tx_data != NULL))
			{
				I2Cx->I2DAT = *txdat++;

				TransferCfg->tx_count++;

				Ret = I2C_BYTE_SENT;
			}
			I2Cx->I2CONSET = I2C_I2CONSET_AA|I2C_I2CONSET_STA;
			I2Cx->I2CONCLR = I2C_I2CONCLR_SIC;
			break;
			
		case I2C_I2STAT_S_TX_LAST_DAT_ACK:
		/* Data has been transmitted, NACK has been received,
		 * that means there's no more data to send, exit now */
		/*
		 * Note: Don't wait for stop event since in slave transmit mode,
		 * since there no proof lets us know when a stop signal has been received
		 * on slave side.
		 */
		case I2C_I2STAT_S_TX_DAT_NACK:
			I2Cx->I2CONSET = I2C_I2CONSET_AA;
			I2Cx->I2CONCLR = I2C_I2CONCLR_SIC;
			Ret = I2C_SEND_END;
			break;

		/* Previously addressed with own SLA;
		 * DATA byte has been received;
		 * NOT ACK has been returned */
		case I2C_I2STAT_S_RX_PRE_SLA_DAT_NACK:

		/* DATA has been received, NOT ACK has been returned */
		case I2C_I2STAT_S_RX_PRE_GENCALL_DAT_NACK:
			I2Cx->I2CONSET = I2C_I2CONSET_AA;
			I2Cx->I2CONCLR = I2C_I2CONCLR_SIC;
			Ret = I2C_RECV_END;
			break;

